docs/1c-export-mobile/MobileAgent/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвотаЕдиницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залишок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВБлоке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЕдиницыСокращенно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>YouTube</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписаниеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПосиланняНаСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>127</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаявніЛоти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЭлемента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВідображатиВШтуках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаАкция</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецАкции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/InformationRegisters/Резервы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>Резервы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТорговийИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УИД_Троговый</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Залишок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вага</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Целевой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаYouTube</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>127</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодБрони</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МояБронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВидео</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриход</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Открыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекторНаСкладі</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВідео</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Catalogs/ХранилищеДополнительнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ХранилищеДополнительнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Catalogs/Номенклатура/Forms/ФормаЭлементаВыбор/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтображатьХарактеристики = Параметры.ОтображатьХарактеристики;
	Если Константы.ОновлюватиЗалишкиПриВиборі.Получить() Тогда 
	Обмен_УправлениеОбменом.ОновитиЗалишкиХарактеристикНоменклатури(Объект.Ссылка);	
	КонецЕсли;
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ХранилищеДополнительнойИнформации.Ссылка
	//|ИЗ
	//|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	//|ГДЕ
	//|	ХранилищеДополнительнойИнформации.Номенклатура = &Номенклатура
	//|	И ХранилищеДополнительнойИнформации.Характеристика = &Характеристика";
	//Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	//Запрос.УстановитьПараметр("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
	//	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Выборка.Ссылка, "Хранилище");
	//	//Элементы.ПолеКартинки.Картинка = Выборка.Ссылка.Хранилище.Получить();
	//КонецЕсли;
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	Штрихкоды.Штрихкод КАК Штрихкод
	          |ИЗ
	          |	РегистрСведений.Штрихкоды КАК Штрихкоды
	          |ГДЕ
	          |	Штрихкоды.Владелец = &Владелец";
	з.УстановитьПараметр("Владелец",Объект.Ссылка);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Штрихкод = Выборка.Штрихкод;
	КонецЕсли;
	
	//з.УстановитьПараметр("ЕдиницаИзмерения");
	
	СсылкаНаКартинку = ПолучитьКартинку(Объект.Ссылка,Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	
	
з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	          |	ЦеныНоменклатуры.Цена КАК Цена,
	          |	ЦеныНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	          |ИЗ
	          |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	          |ГДЕ
	          |	НЕ ЦеныНоменклатуры.ТипЦен.ЭтоЦенаПартнера
	          |	И ЦеныНоменклатуры.Номенклатура = &Номенклатура
	          |	И ЦеныНоменклатуры.ХарактеристикаНоменклатуры = &ПустаяХарактеристика";
			  з.УстановитьПараметр("Номенклатура",Объект.Ссылка);
			  з.УстановитьПараметр("ПустаяХарактеристика",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Цена = Формат(Выборка.Цена,"ЧДЦ=2") + " EUR.";
		ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
	КонецЕсли;
	
	
	//з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//          |	НормыЗапасов.Количество
	//          |ИЗ
	//          |	РегистрСведений.НормыЗапасов КАК НормыЗапасов
	//          |ГДЕ
	//          |	НормыЗапасов.Номенклатура = &Номенклатура
	//          |	И НормыЗапасов.ХарактеристикаНоменклатуры = &ПустаяХарактеристика
	//          |	И НормыЗапасов.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	//		  з.УстановитьПараметр("Номенклатура",Объект.Ссылка);
	//		  з.УстановитьПараметр("ПустаяХарактеристика",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	//		  з.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	//Выборка = з.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Заказать = Выборка.Количество;
	//КонецЕсли;
	ТипЦен = Параметры.ТипЦен;
	УИД = Параметры.УИД;
	
	
	ВремКарт = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.NoImage,ЭтаФорма.УникальныйИдентификатор);	

	 СсылкаНаКартинку = ВремКарт;     
	 Элементы.СсылкаНаКартинку.РазмерКартинки = РазмерКартинки.АвтоРазмер;	
	
	СоздатьЭлементыХарактеристик();
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХарактеристикиНоменклатуры.Ссылка) КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.ПериодБрони > &ПериодБрони
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Резервы.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.Резервы КАК Резервы
		|ГДЕ
		|	Резервы.Номенклатура = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПериодБрони", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда 
		Элементы.ИнфоБронь.Заголовок = "Заброньовано мішків: " + Выборка.Ссылка;
		Элементы.ИнфоБронь.Видимость = Истина;
	КонецЕсли;
	
	Выборка = Результат[1].Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Количество) Тогда 
		Элементы.ИнфоРезерв.Заголовок = "Мішків у резерві: " + Выборка.Количество;
		Элементы.ИнфоРезерв.Видимость = Истина;
	КонецЕсли;


КонецПроцедуры


&НаСервере
Процедура СоздатьЭлементыХарактеристик()     
	//ИспользоватьПачки = Константы.ПідбірВПачкахШтуках.Получить();
	//Если ИспользоватьПачки Тогда 
	//	Элементы.Декорация2.Заголовок = "Замовити:";
	//КонецЕсли;
	
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	|	Товари.Характеристика КАК Характеристика,
	|	МАКСИМУМ(Товари.ЦенаОбщая) КАК ЦенаОбщая,
	|	СУММА(Товари.Остаток) КАК Остаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ХарактеристикиНоменклатуры.Ссылка.Вага КАК Характеристика,
	|		ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|		ЕСТЬNULL(ЦеныНоменклатурыБезХарактеристик.Цена, 0) КАК ЦенаОбщая,
	|		ХарактеристикиНоменклатуры.Залишок КАК Остаток,
	|		0 КАК Штрихкод,
	|		""міш."" КАК ЕдиницаИзмерения
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
	|			ХарактеристикиНоменклатуры.Владелец КАК Владелец,
	|			ХарактеристикиНоменклатуры.Залишок КАК Залишок
	|		ИЗ
	|			Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ГДЕ
	|			ХарактеристикиНоменклатуры.Владелец = &Владелец) КАК ХарактеристикиНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|			ПО (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатуры.Ссылка)
	|				И (ЦеныНоменклатуры.ТипЦен = &ТипЦен)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатурыБезХарактеристик
	|			ПО ХарактеристикиНоменклатуры.Владелец = ЦеныНоменклатурыБезХарактеристик.Номенклатура
	|				И (ЦеныНоменклатурыБезХарактеристик.ТипЦен = &ТипЦен)
	|				И (ЦеныНоменклатурыБезХарактеристик.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)) КАК Товари
	|ГДЕ
	|	Товари.Остаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Товари.Характеристика";
	з.УстановитьПараметр("Владелец",Объект.Ссылка);
	з.УстановитьПараметр("ТипЦен",ТипЦен);
	з.УстановитьПараметр("ПустаяХарактеристика",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	
	Выборка = з.Выполнить().Выбрать();
	НомерЭлементаГруппы = 1;  
	Стр = "";
	
	Если ОтображатьХарактеристики Тогда 
		Элементы.ИнформацияОХарактеристиках.Видимость = Ложь;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Если Цена = 0 Тогда
			Цена =  Выборка.ЦенаОбщая;
		КонецЕсли;
		
		Если НЕ ОтображатьХарактеристики Тогда
			
			НовСтр = ИнформацияОХарактеристиках.Добавить();
			НовСтр.Вага = Выборка.Характеристика;
			НовСтр.Залишок = Выборка.Остаток;
		Иначе 	
			// СТВОРЕННЯ ЕЛЕМЕНТІВ УПРАВЛІННЯ
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			МассивУдаляемыхРеквизитов = Новый Массив;
			
			//ЭлементСтраницы = Элементы["Характеристика"+НомерЭлементаГруппы];	
			
			ТипСтрока = Новый ОписаниеТипов("Строка");
			ТипЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,0));
			ТипЦена = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2));
			
			ТипХарактеристика = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
			ТипЕдИзм = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения");
			
			ЭлементСтраницы = Элементы.Добавить("Характеристика"+НомерЭлементаГруппы, Тип("ГруппаФормы"), Элементы.ГруппаХарактеристик);
			ЭлементСтраницы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			//ш = Новый Шрифт(,,Истина);
			//ЭлементСтраницы.Уст = ш;
			ЭлементСтраницы.Заголовок = "Мішок вагою: " + Выборка.Характеристика;
			//ЭлементСтраницы.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
			ЭлементСтраницы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			//	ЭлементСтраницы.Свернута = Истина;
			ЭлементСтраницы.ЗаголовокСвернутогоОтображения = Выборка.Характеристика;
			/////////////////////////////////////////////////////////////////////////СТВОРЕННЯ РЕКВІЗИТІВ
			
			
			
			Картинка = Новый РеквизитФормы("Картинка"+НомерЭлементаГруппы, ТипСтрока, "", "Картинка");
			МассивДобавляемыхРеквизитов.Добавить(Картинка);
			ШК = Новый РеквизитФормы("Штрихкод"+НомерЭлементаГруппы, ТипХарактеристика, "", "Штрихкод");
			МассивДобавляемыхРеквизитов.Добавить(ШК);
			ЕдИзм = Новый РеквизитФормы("ЕдиницаИзмерения"+НомерЭлементаГруппы, ТипЕдИзм, "", "Од. вим.");
			МассивДобавляемыхРеквизитов.Добавить(ЕдИзм);
			Характ = Новый РеквизитФормы("Характеристика"+НомерЭлементаГруппы, ТипХарактеристика, "", "Характеристика");
			МассивДобавляемыхРеквизитов.Добавить(Характ);
			ЦенаТов = Новый РеквизитФормы("Цена"+НомерЭлементаГруппы, ТипЦена, "", "Ціна");	
			МассивДобавляемыхРеквизитов.Добавить(ЦенаТов);
			НормаЗапасов = Новый РеквизитФормы("Остаток"+НомерЭлементаГруппы, ТипСтрока, "", "Залишок");		
			МассивДобавляемыхРеквизитов.Добавить(НормаЗапасов);	
			НормаЗапасов = Новый РеквизитФормы("Заказать"+НомерЭлементаГруппы, ТипЧисло, "", "Замовити");		
			МассивДобавляемыхРеквизитов.Добавить(НормаЗапасов);		
			НоваяКоманда = Команды.Добавить("Добавить"+НомерЭлементаГруппы);
			НоваяКоманда.Действие   = "Добавить";	
			
			
			///////////////////////////////////////////////////////////////////////////////////////////////////////////////
			
			
			
			//
			
			//////////////////////////////////////////////////////////////////////////////////////////СТВОРЕННЯ ЕЛЕМЕНТІВ
			
			
			///////////////////////////////////////////////////////////////////////////////// КАРТИНКА
			//ЭлементКартинка = Элементы.Добавить("Картинка"+НомерЭлементаГруппы, Тип("ПолеФормы"), ЭлементСтраницы);
			//ЭлементКартинка.Вид = ВидПоляФормы.ПолеКартинки;
			//ЭлементКартинка.ПутьКДанным = "Картинка"+НомерЭлементаГруппы;
			//ЭлементКартинка.Ширина = 9;
			//ЭлементКартинка.Высота = 4;
			//ЭлементКартинка.РастягиватьПоГоризонтали = Ложь;
			//ЭлементКартинка.Видимость = Истина;
			//ЭлементКартинка.РастягиватьПоВертикали = Ложь;
			//ЭлементКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
			//ЭлементКартинка.Гиперссылка = Истина;
			//ЭлементКартинка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			//ЭлементКартинка.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки,0);
			
			//ЭтаФорма["Картинка"+НомерЭлементаГруппы] =  ПолучитьКартинку(Объект.Ссылка,Выборка.Характеристика);
			//ЭлементКартинка.УстановитьДействие("Нажатие","СсылкаНаКартинкуНажатие");
			/////////////////////////////////////////////////////////////////////////////////
			
			ЭлементПодгруппа = Элементы.Добавить("ЭлементПодгруппа"+НомерЭлементаГруппы,Тип("ГруппаФормы"),ЭлементСтраницы);
			ЭлементПодгруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ЭлементПодгруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			ЭлементПодгруппа.РастягиватьПоГоризонтали = Истина;
			ЭлементПодгруппа.РастягиватьПоВертикали = Ложь;
			//ЭлементПодгруппа.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
			ЭлементПодгруппа.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
			ЭлементПодгруппа.ОтображатьЗаголовок = Ложь;
			//ЭлементПодгруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);
			ЭлементШтрихкод = Элементы.Добавить("ЭлементШК"+НомерЭлементаГруппы,Тип("ПолеФормы"),ЭлементПодгруппа);
			ЭлементШтрихкод.ПутьКДанным = "Штрихкод"+НомерЭлементаГруппы;
			ЭлементШтрихкод.Заголовок = "Вага";
			ЭлементШтрихкод.Вид = ВидПоляФормы.ПолеНадписи;
			ЭлементШтрихкод.Видимость = Ложь;
			ЭтаФорма["Штрихкод"+НомерЭлементаГруппы] = Выборка.Штрихкод; 
			
			
			ЭтаФорма["Характеристика"+НомерЭлементаГруппы] = Выборка.Характеристика;
			
			ЭлементЦена = Элементы.Добавить("ЭлементЦена"+НомерЭлементаГруппы,Тип("ПолеФормы"),ЭлементПодгруппа);
			ЭлементЦена.ПутьКДанным = "Цена"+НомерЭлементаГруппы;
			ЭлементЦена.Вид = ВидПоляФормы.ПолеВвода;
			Если ЗначениеЗаполнено(Выборка.Цена) Тогда 
				
				ЭтаФорма["Цена"+НомерЭлементаГруппы] = Формат(Выборка.Цена,"ЧДЦ=2");
			ИначеЕсли ЗначениеЗаполнено(Выборка.ЦенаОбщая) Тогда 
				
				ЭтаФорма["Цена"+НомерЭлементаГруппы] = Формат(Выборка.ЦенаОбщая,"ЧДЦ=2");
				
			КонецЕсли;
			
			ЭлементЕдИзм = Элементы.Добавить("ЭлементОстаток"+НомерЭлементаГруппы,Тип("ПолеФормы"),ЭлементПодгруппа);
			ЭлементЕдИзм.ПутьКДанным = "Остаток"+НомерЭлементаГруппы;
			ЭлементЕдИзм.Вид = ВидПоляФормы.ПолеНадписи;
			ЭлементЕдИзм.Заголовок = "Залишок";
			ЭтаФорма["Остаток"+НомерЭлементаГруппы] = Строка(Выборка.Остаток) + " міш.";
			
			//ЭлементЕдИзм = Элементы.Добавить("ЭлементЕдИзм"+НомерЭлементаГруппы,Тип("ПолеФормы"),ЭлементПодгруппа);
			//ЭлементЕдИзм.ПутьКДанным = "ЕдиницаИзмерения"+НомерЭлементаГруппы;
			//ЭлементЕдИзм.Вид = ВидПоляФормы.ПолеНадписи;
			//ЭлементЕдИзм.РастягиватьПоГоризонтали = Истина;
			//ЭтаФорма["ЕдиницаИзмерения"+НомерЭлементаГруппы] = Выборка.ЕдиницаИзмерения;
			
			
			ЭлементПодгруппаЗаказ = Элементы.Добавить("ЭлементПодгруппаЗаказ"+НомерЭлементаГруппы,Тип("ГруппаФормы"),ЭлементПодгруппа);
			ЭлементПодгруппаЗаказ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ЭлементПодгруппаЗаказ.Отображение = ОтображениеОбычнойГруппы.Нет;
			ЭлементПодгруппаЗаказ.РастягиватьПоГоризонтали = Истина;
			ЭлементПодгруппаЗаказ.РастягиватьПоВертикали = Ложь;
			//ЭлементПодгруппа.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
			ЭлементПодгруппаЗаказ.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
			ЭлементПодгруппаЗаказ.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
			ЭлементПодгруппаЗаказ.ОтображатьЗаголовок = Ложь;
			ЭлементПодгруппаЗаказ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ЭлементПодгруппаЗаказ.Высота = 2;
			
			
			ЭлементДекорация = Элементы.Добавить("Дек"+НомерЭлементаГруппы, Тип("ДекорацияФормы"), ЭлементПодгруппаЗаказ);
			ЭлементДекорация.РастягиватьПоВертикали = Истина;
			
			ЭлементДекорация.Вид = ВидДекорацииФормы.Надпись;
			//ЭлементДекорация.ЦветФона = Новый Цвет(0,0,0);
			ЭлементДекорация.Высота = 0;
			//Если ИспользоватьПачки Тогда 
			//	ЭлементДекорация.Заголовок = "Замовити:";
			//Иначе 
			ЭлементДекорация.Заголовок = "Замовити (мішків):";
			//КонецЕсли;
			
			
			ЭлементНормаЗапасов = Элементы.Добавить("ЭлементЗаказать"+НомерЭлементаГруппы,Тип("ПолеФормы"),ЭлементПодгруппаЗаказ); //////////
			ЭлементНормаЗапасов.ПутьКДанным = "Заказать"+НомерЭлементаГруппы;
			ЭлементНормаЗапасов.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементНормаЗапасов.Ширина = 5;
			//ЭлементНормаЗапасов.Высота = 2;
			ЭлементНормаЗапасов.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			//ЭлементНормаЗапасов.ЦветФона = Новый Цвет(255,255,255);
			//ЭлементНормаЗапасов.ЦветТекста = Новый Цвет(0,0,0);
			ЭлементНормаЗапасов.ЦветРамки = Новый Цвет(51,102,255);
			//ЭлементНормаЗапасов.ТолькоПросмотр = Истина;
			ЭлементНормаЗапасов.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			ЭтаФорма["Заказать"+НомерЭлементаГруппы] = 1;
			ЭлементНормаЗапасов.УстановитьДействие("ПриИзменении","ЗаказатьПриИзменении");
			ЭлементНормаЗапасов.РастягиватьПоВертикали = Истина;
			
			
			// создадим кнопку
			ЭлементДобавить        = Элементы.Добавить("Добавить"+НомерЭлементаГруппы, Тип("КнопкаФормы"), ЭлементПодгруппаЗаказ);
			ЭлементДобавить.Вид    = ВидКнопкиФормы.ОбычнаяКнопка; // вид кнопки
			//ЭлементДобавить.ЦветФона = Новый Цвет(233,230,212);
			ЭлементДобавить.ЦветТекста = Новый Цвет(51,153,102);
			ЭлементДобавить.ЦветРамки = Новый Цвет(153,153,153);
			ЭлементДобавить.Высота = 2;
			ЭлементДобавить.РастягиватьПоВертикали = Ложь;
			
			ЭлементДобавить.Заголовок  = "Додати";
			ЭлементДобавить.ИмяКоманды = "Добавить"+НомерЭлементаГруппы;
			//
			//ЭлементДекорация = Элементы.Добавить("Дек"+НомерЭлементаГруппы, Тип("ДекорацияФормы"), ЭлементПодгруппа);
			ЭлементДекорация.РастягиватьПоВертикали = Истина;
			//
			//ЭлементДекорация.Вид = ВидДекорацииФормы.Надпись;
			//ЭлементДекорация.ЦветФона = Новый Цвет(0,0,0);
			//ЭлементДекорация.Высота = 10;
			
			
			НомерЭлементаГруппы = НомерЭлементаГруппы + 1;
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИспользованиеПачек()
	Возврат Константы.ПідбірВПачкахШтуках.Получить();
КонецФункции


&НаСервере
Функция ПолучитьКартинку(Номенклатура,Знач Характеристика = Неопределено)
	Если Характеристика = Неопределено Тогда 
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Номенклатура = &Номенклатура
	|	И ХранилищеДополнительнойИнформации.Характеристика = &Характеристика";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);                             
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Возврат ПолучитьНавигационнуюСсылку(Выборка.Ссылка, "Хранилище");
		//Элементы.ПолеКартинки.Картинка = Выборка.Ссылка.Хранилище.Получить();
	Иначе 
		
		Возврат ПоместитьВоВременноеХранилище(БиблиотекаКартинок.NoImage,ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	Возврат "";
КонецФункции




&НаКлиенте
Процедура СсылкаНаКартинкуНажатие(Элемент, СтандартнаяОбработка)
	ИмяЭлемента = СтрЗаменить(Элемент.Имя,"СсылкаНаКартинку","");
	СтандартнаяОбработка = Ложь;
	ПараметрыКартинки = Новый Структура();
	ПараметрыКартинки.Вставить("СсылкаНаКартинку",ЭтотОбъект[Элемент.Имя]);
	ПараметрыКартинки.Вставить("Наименование",Объект.Наименование);
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда 
	ПараметрыКартинки.Вставить("Характеристика",Элементы["Характеристика"+СтрЗаменить(ИмяЭлемента,"Картинка","")].Заголовок);
		КонецЕсли;
	ПараметрыКартинки.Вставить("Штрихкод",ЭтотОбъект["Штрихкод"+СтрЗаменить(ИмяЭлемента,"Картинка","")]);
	ПараметрыКартинки.Вставить("ЕдиницаИзмерения",ЭтотОбъект["ЕдиницаИзмерения"+СтрЗаменить(ИмяЭлемента,"Картинка","")]);
	ПараметрыКартинки.Вставить("Цена",ЭтотОбъект["Цена"+СтрЗаменить(ИмяЭлемента,"Картинка","")]);
	ФормаПросмотраКартинки = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаПросмотраКартинки",ПараметрыКартинки,ЭтаФорма);
	ФормаПросмотраКартинки.Открыть();
	
	
	
//		Картинка = Параметры.СсылкаНаКартинку;
//	Наименование = Параметры.Наименование;

//	Характеристика = Параметры.Характеристика;

//	ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
//Цена = Параметры.Цена;
//Штрихкод = Параметры.Штрихкод;

	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура НормаЗапасаОкончаниеВводаТекстаНаСервере(Номенклатура,Знач ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Количество)
	//Если ХарактеристикаНоменклатуры = Неопределено Тогда 
	//	ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	//КонецЕсли;
	//
	//нз =РегистрыСведений.НормыЗапасов.СоздатьНаборЗаписей();
	//нз.Отбор.Номенклатура.Установить(Номенклатура);	
	//нз.Отбор.ХарактеристикаНоменклатуры.Установить(ХарактеристикаНоменклатуры);
	//нз.Отбор.ЕдиницаИзмерения.Установить(ЕдиницаИзмерения);
	//зап = нз.Добавить();
	//зап.Номенклатура = Номенклатура;
	//зап.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	//зап.ЕдиницаИзмерения = ЕдиницаИзмерения;
	//зап.Количество = Количество;
	//зап.Дата = ТекущаяДата();
	//нз.Записать();
	//
	//Общий.ЗарегистрироватьИзменения(Номенклатура.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура НормаЗапасаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	//Если Элемент.Имя = "НормаЗапаса" Тогда 
	//	ТекЕдиницаИзмерения = ЕдиницаИзмерения;
	//	ТекХарактристика = Неопределено;
	//Иначе
	//	ТекЕдиницаИзмерения = ЭтотОбъект["ЕдиницаИзмерения"+СтрЗаменить(Элемент.Имя,"ЭлементНормаЗапаса","")];
	//	ТекХарактристика = ЭтотОбъект["Характеристика"+СтрЗаменить(Элемент.Имя,"ЭлементНормаЗапаса","")];	
	//КонецЕсли;
	//НормаЗапасаОкончаниеВводаТекстаНаСервере(Объект.Ссылка,ТекХарактристика,ТекЕдиницаИзмерения,Число(Текст));
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьВПачкахШтуках()
	 Возврат Константы.ПідбірВПачкахШтуках.Получить();
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Объект.Просмотр Тогда 
		Отказ = Истина;
	КонецЕсли;
	Заказать = 1;
	
	
		//Если ПолучитьВПачкахШтуках() Тогда 
		//	Элементы.Декорация2.Заголовок = "Замовити:";
		//Иначе                                                                                   
			Элементы.Декорация2.Заголовок = "Замовити (мішків):";
		//КонецЕсли;
   
КонецПроцедуры


&НаКлиенте
Процедура Добавить(Команда)
	ТекИмя = ЭтотОбъект["Штрихкод"+СтрЗаменить(Команда.Имя,"Добавить","")];
		 ВБлоке = Объект.ВБлоке;
		 Если Не ЗначениеЗаполнено(ВБлоке) Тогда 
			 ВБлоке = 1;
		 КонецЕсли;
		 Если ПолучитьИспользованиеПачек() Тогда 
			 ВБлоке = 1;
		 КонецЕсли;
		 
		 
		//СтруктураТовара = Общий.ПолучитьДанныеТовараПоСсылке(ТекИмя);
		//СтруктураТовара = Общий.ПолучитьДанныеТовара(,ТекХарактристика,ТекЕдиницаИзмерения);
		
		//ФормаПодтверждения = ПолучитьФорму("Документ.Заказ.Форма.ФормаПодтверждения",СтруктураТовара,ЭтаФорма);	
		//ФормаПодтверждения.Открыть();
		//Если ТекКоличество < Количество Тогда 
		//	Количество = ТекКоличество;
		//КонецЕсли;
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Номенклатура",Объект.Ссылка);
		СтруктураВозврата.Вставить("ХарактеристикаНоменклатуры",ЭтотОбъект["Штрихкод"+СтрЗаменить(Команда.Имя,"Добавить","")]);
		СтруктураВозврата.Вставить("ЕдиницаИзмерения",ЭтотОбъект["ЕдиницаИзмерения"+СтрЗаменить(Команда.Имя,"Добавить","")]);
		СтруктураВозврата.Вставить("Количество",ЭтотОбъект["Заказать"+СтрЗаменить(Команда.Имя,"Добавить","")] * ВБлоке);
		СтруктураВозврата.Вставить("Штрихкод","");
		СтруктураВозврата.Вставить("УИД",УИД);
		СтруктураВозврата.Вставить("Цена",ЭтотОбъект["Цена"+СтрЗаменить(Команда.Имя,"Добавить","")]);
			   //ЭтаФорма["Цена"+НомерЭлементаГруппы]
		//ОповеститьОВыборе(СтруктураВозврата);
		Оповестить("Подбор",СтруктураВозврата);
		Оповестить("ДоданоТовар", Объект.Ссылка);
		Закрыть();
	//Сообщить(Команда.Имя);
КонецПроцедуры

//&НаКлиенте
//Процедура YouTubeНажатие(Элемент, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	#Если МобильноеПриложениеКлиент Тогда
//		ЗапуститьПриложение(Объект.YouTube);	
//	#КонецЕсли
//КонецПроцедуры
